/**
 * 给定一个由若干 0 和 1 组成的数组 A，我们最多可以将 K 个值从 0 变成 1
 * 返回仅包含 1 的最长（连续）子数组的长度
 *
 * 示例 1：
 * 输入：A = {1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0}, K = 2
 * 输出：6
 * 解释：
 * [1,1,1,0,0,1,1,1,1,1,1]
 * 粗体数字从 0 翻转到 1，最长的子数组长度为 6
 *
 * 示例 2：
 * 输入：A = [0,0,1,1,0,0,1,1,1,0,1,1,0,0,0,1,1,1,1], K = 3
 * 输出：10
 * 解释：
 * [0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,1]
 * 粗体数字从 0 翻转到 1，最长的子数组长度为 10
 */
#include <iostream>
#include <algorithm>
using namespace std;

/*
    该问题可以等价于找到一个满足0的个数不超过K最长区间
*/

int main()
{
    int A[] = {0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1};
    int sz = sizeof(A) / sizeof(A[0]);
    int K = 3;

    int l = 0, r = 0;
    int maxlen = 1;
    // 维护区间中 0 的个数
    int zeroCnt = 0;

    for (r = 0; r < sz; r++)
    {
        if (A[r] == 0)
            zeroCnt++;
        // 知道区间中 0 的个数小于等于 K，才停止移动左指针
        while (zeroCnt > K)
        {
            if (A[l] == 0)
                zeroCnt--;
            l++;
        }
        maxlen = max(maxlen, r - l + 1);
    }

    cout << maxlen << endl;
}